#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	double a = 5 % 2;//取模操作符，必须左右值都是整数
//	printf("a = %lf", a);
//	return 0;
//}


//int main()
//{
//	//int a = 16;
//	////>>  --右移操作符   右边丢弃，左边补符号位（算数移位）  右边丢弃，左边补0（逻辑移位）
//  右移一位有除二的效果
//	////移动的是二进制位
//	////00000000 00000000 00000000 00010000
//	////00000000 00000000 00000000 00001000
//	//int b = a >> 1;
//	int a = -1;
//	// 整数的二进制表示有三种
//	// 存储到内存中的是补码
//	// 原码：10000000 00000000 00000000 00000001
//	// 反码：11111111 11111111 11111111 11111110 --符号位不变，其他位按位取反
//	// 补码：11111111 11111111 11111111 11111111 --反码+1
//	int b = a >> 1;
//	printf("b = %d", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	//左移操作符，左边丢弃，右边补0
//	//左移一位，有乘2的效果
//	int b = a << 1;
//	printf("%d", b);
//	return 0;
//}

//int main()
//{
//	//按位与
//	//int a = 3;
//	//int b = 5;
//	////00000000 00000000 00000000 00000011---3
//	////00000000 00000000 00000000 00000101---5	& 按位与
//	////00000000 00000000 00000000 00000001---1
//	//int c = a & b;
//	//printf("%d", c);
//	
//	//按位或
//	//int a = 3;
//	//int b = 5;
//	////00000000 00000000 00000000 00000011---3
//	////00000000 00000000 00000000 00000101---5	| 按位或
//	////00000000 00000000 00000000 00000111---7
//	//int c = a | b;
//	//printf("%d", c);
//
//	//按位异或，相同为0  相异为1
//	int a = 3;
//	int b = 5;
//	//00000000 00000000 00000000 00000011---3
//	//00000000 00000000 00000000 00000101---5	^ 按位异或
//	//00000000 00000000 00000000 00000110---6
//	int c = a ^ b;
//	printf("%d", c);
//	return 0;
//}

//int main()
//{
//	//不用第三个变量交换ab的值--- 异或
//	int a = 3;
//	int b = 5;
//	printf("before: a = %d  b = %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("after: a = %d  b = %d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	//统计num（补码）中有几个1
//	int i = 0;
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	for ( i = 0; i < 32; i++)
//	{
//		if (1==((num >> i) & 1))
//		{
//			count+=1;
//		}
//	}
//	printf("%d", count);
//	return 0;
//}

//int main()
//{
//	//int a = 10;
//	//a = a + 2;
//	//a += 2; //复合赋值符
//
//	//a = a >> 1;
//	//a >>= 1;//复合赋值符
//
//	//a = a & 1;
//	//a &= 1;//复合赋值符
//
//	/*int a = 0;
//	if (!a)
//	{
//		printf("芜湖");
//	}
//	return 0;*/
//}

int main()
{
	//int a = 10;
	//char c = 'r';
	//char* p = &c;
	//int arr[10] = { 0 };
	////sizeof 计算的是变量所占内存空间的大小，单位是字节
	//printf("%d\n", sizeof(a));//4
	//printf("%d\n", sizeof(c));//1
	//printf("%d\n", sizeof(p));//8
	//printf("%d\n", sizeof(arr));//40

	short s = 0;
	int a = 10;
	//sizeof 括号内的值不参与运算，所以下面的打印s的值，仍然是0
	printf("%d\n", sizeof(s = a + 5));
	printf("%d\n",s);






	return 0;
}